// 载具 ─────────────────────────────────────────────────────────────

export const VEHICLE_DATA = {
  卡车: {
    柴油: ['皮卡', '卡车', '两栖卡车', '水陆两用挖掘机', '巨型卡车(液体)', '巨型卡车(散装)'],
    氢:   ['卡车【氢】', '两栖卡车【氢】', '水陆两用挖掘机【氢】', '巨型卡车(散装)【氢】', '巨型卡车(液体)【氢】'],
  },
  开采: {
    柴油:{
      "挖掘机":['小型挖掘机', '挖掘机', '超大型挖掘机'],
      "伐木机":['伐木机', '大型伐木机']
    },
    氢:{
      "挖掘机":['挖掘机【氢】', '超大型挖掘机【氢】'],
      "伐木机":['大型伐木机【氢】']
    }
  },
  火车: {
    '1级': ['蒸汽机车', '柴油机车', '氢能机车', '电力机车'],
    '2级': ['蒸汽机车 II', '柴油机车 II', '氢能机车 II', '电力机车 II', '无火蒸汽机车', '燃气涡轮机车', '核动力机车'],
  },
  船舶: {
    柴油: ['货运港（2）', '货运港（4）', '货运港（6）', '货运港（8）'],
    重油: ['货运港（2）', '货运港（4）', '货运港（6）', '货运港（8）'],
    氢:   ['货运港（2）', '货运港（4）', '货运港（6）', '货运港（8）'],
  },
  火箭:["火箭 I","火箭 II"]
}

// 居民需求────────────────────────────────────────────────────────

export const HOUSING_OPTIONS   = ['住房 I', '住房 II', '住房 III', '住房 IV']
export const FOOD_OPTIONS      = ['土豆', '蔬菜', '面包', '玉米', '豆腐', '鸡蛋', '肉', '零食', '水果', '蛋糕', '香肠']
export const MEDICINE_OPTIONS  = ['医疗用品 I', '医疗用品 II', '医疗用品 III']
export const SERVICE_OPTIONS   = ['水', '家庭用品', '家用设备', '消费类电子产品', '奢侈品', '电', '算力']
export const FARM_OPTIONS   = ['灌溉农场', '温室 I', '温室 II']

// 建筑 ────────────────────────────────────────────────────────────

export const FACILITY_OPTIONS  = ['空间站', '维护雕像','列车车库',"堆垛塔","矿石分拣设施","大型矿石分拣设施"]
export const RESEARCH_OPTIONS  = [ '研究实验室 IV', '研究实验室 III', '研究实验室 II', '研究实验室 I']
// 物流 ─────────────────────────────────────────────────────────

export const TRUCK_FUELS  = ['柴油', '氢']
export const TRAIN_TIERS = ['1级', '2级']

// 原矿 ───────────────────────────────────────────────────────────

export const MINER_FUELS   = ['柴油', '氢']
export const SHIP_FUELS    = ['柴油', '重油', '氢']
export const CARGO_DEPOTS  = ['货运港（2）', '货运港（4）', '货运港（6）', '货运港（8）']
export const MAP_MINES     = ['煤', '铁矿石', '铜矿石', '沙', '石英', '石灰石', '金矿石', '铀矿石', '钛矿石', '铝土矿', '岩石', '木材']
export const OCEAN_MINES   = ['原油', '煤', '铁矿石', '铜矿石', '石英', '石灰石', '金矿石', '铀矿石', '钛矿石', '铝土矿', '硫', '岩石', '水']

